from django.conf import settings


FAQ_TEXTS = {
    settings.BB_LANGUAGE_CODE_KK: (
        (
            "bbtest.kz сайтының тест сұрақтарын кім әзірлейді?",
            "bbtest.kz сайтының тест сұрақтарын Назарбаев Зияткерлік мектептерінде, сондай-ақ жалпы білім беретін мектептерде жұмыс тәжірибесі мол арнайы оқытылған пән мұғалімдері әзірлеген.",
        ),
        (
            "bbtest.kz сайтының тест сұрақтары шынайы тестілеу сұрақтарымен қаншалықты ұқсас?",
            "bbtest.kz сайтының тест сұрақтары шынайы тестілеу сұрақтарымен құрастыру құрылымы мен күрделілігі жағынан ұқсас. Бұл сұрақтар нақты тестілеуде болуы мүмкін емес, дегенмен жақсы тренажер ретінде және тәжірибе жинауға пайдалы болып табылады.",
        ),
        (
            "bbtest.kz сайтындағы 1 бірлік қанша теңгеге тең?",
            "bbtest.kz сайтындағы 1 бірлік 1 теңгеге тең.",
        ),
    ),
    settings.BB_LANGUAGE_CODE_RU: (
        (
            "Кем разработаны тестовые вопросы сайта bbtest.kz?",
            "Тестовые вопросы сайта bbtest.kz разработаны обученными учителями-предметниками, имеющими опыт работы как в НИШ, так и в общеобразовательных школах.",
        ),
        (
            "Насколько похожи тестовые вопросы сайта bbtest.kz с вступительными тестами НИШ?",
            "Тестовые вопросы сайта bbtest.kz похожи с вступительными тестами НИШ по сложности и структуре составления. Данные вопросы не могут быть в настоящем тесте НИШ, но являются хорошим тренажером и практикой.",
        ),
        (
            "Чему равна 1 единица на сайте bbtest.kz?",
            "1 единица на сайте bbtest.kz равна 1 тенге.",
        ),
    ),
}
