from django.conf import settings


FAQ_TEXTS = {
    settings.BB_LANGUAGE_CODE_KK: (
        (
            "ENTapp.kz сайтының тест сұрақтарын кім әзірлейді?",
            "ENTapp.kz сайтының тест сұрақтарын ҰБТ 2016, 2017, 2018 құрастыруына қатысқан арнайы оқытылған пән мұғалімдері әзірлеген.",
        ),
        (
            "ENTapp.kz сайтының тест сұрақтары ҰБТ 2019 сұрақтарымен қаншалықты ұқсас?",
            "ENTapp.kz сайтының тест сұрақтары ҰБТ 2019 сұрақтарымен құрастыру құрылымы мен күрделілігі жағынан ұқсас. Бұл сұрақтар нақты тестілеуде болуы мүмкін емес, дегенмен жақсы тренажер ретінде және тәжірибе үшін өте пайдалы болып табылады.",
        ),
        # (
        #     "ENTapp.kz сайтындағы 1 бірлік қанша теңгеге тең?",
        #     "ENTapp.kz сайтындағы 1 бірлік 1 теңгеге тең.",
        # ),
    ),
    settings.BB_LANGUAGE_CODE_RU: (
        (
            "Кем разработаны тестовые вопросы сайта ENTapp.kz?",
            "Тестовые вопросы сайта ENTapp.kz разработаны обученными учителями-предметниками, имеющими опыт работы в составлении тестовых вопросов ЕНТ 2016, 2017, 2018.",
        ),
        (
            "Насколько похожи тестовые вопросы сайта ENTapp.kz с ЕНТ 2019?",
            "Тестовые вопросы сайта ENTapp.kz похожи с ЕНТ 2019 по сложности и структуре составления. Данные вопросы не могут быть в предстоящем ЕНТ, но являются хорошим тренажером и практикой.",
        ),
        # (
        #     "Чему равна 1 единица на сайте ENTapp.kz?",
        #     "1 единица на сайте ENTapp.kz равна 1 тенге.",
        # ),
    ),
}
