from collections import defaultdict
from django.conf import settings

RUS = settings.BB_LANGUAGE_CODE_RU
KAZ = settings.BB_LANGUAGE_CODE_KK

POLOR_AREA_COMMON_TEXT = defaultdict(lambda: {RUS: "", KAZ: ""})
POLOR_AREA_RECOMEND_TEXT = defaultdict(lambda: {RUS: {0: "", 200: "", 400: ""}, KAZ: {0: "", 200: "", 400: ""}})


POLOR_AREA_COMMON_TEXT[9584][RUS] = """
<p>
  Читательская грамотность направлена на оценку способностей учащихся читать тексты, понимать и интерпретировать информацию, а также использовать её для расширения своих знаний, достижения различных целей и возможности, участвовать в жизни общества.
</p>

<h3><strong>Основные аспекты читательской грамотности:</strong></h3>
<ul>
  <li>
    <strong>Чтение и понимание текста:</strong> Способность понимать и интерпретировать различные типы текстов, включая литературные произведения, научные статьи, новостные сообщения и другие материалы.
  </li>
  <li>
    <strong>Анализ и синтез информации:</strong> Умение анализировать текст, выделять ключевые идеи, сравнивать и сопоставлять информацию из разных источников.
  </li>
  <li>
    <strong>Критическое мышление:</strong> Способность критически оценивать прочитанное, распознавать предвзятость и искажения, делать обоснованные выводы.
  </li>
  <li>
    <strong>Применение знаний:</strong> Использование прочитанной информации для решения практических задач, участия в обсуждениях и принятия информированных решений.
  </li>
</ul>

<h3>Цели направления:</h3>
<ol>
  <li>Определить уровень читательских навыков учащихся в разных странах и регионах.</li>
  <li>Проанализировать, какие стратегии преподавания и обучения наиболее эффективны для улучшения навыков чтения.</li>
  <li>Повысить осведомленность общественности и политиков о важности развития критического и аналитического мышления в процессе чтения.</li>
</ol>
"""


POLOR_AREA_RECOMEND_TEXT[9584][RUS][0] = """
<p>
  Учащиеся в среднем набрали <strong>{}</strong> из максимально возможных <strong>600 баллов</strong>.
</p>
<p>
  Данный результат является <em>ниже среднего</em>. Учащиеся на этом уровне имеют значительные трудности в понимании текста и интерпретации информации. Они не могут полностью извлечь основные идеи из прочитанного и часто испытывают проблемы с анализом и синтезом информации. Критическое мышление на данном уровне слабое, что затрудняет формирование обоснованных выводов. Способность применять знания для решения практических задач ограничена.
</p>

<h3>Рекомендации:</h3>
<ul>
  <li>Развивать базовые навыки чтения с акцентом на понимание основного содержания.</li>
  <li>Включать в учебный процесс упражнения для улучшения способности выделять ключевые идеи.</li>
  <li>Постепенно вводить задачи на критическое мышление и анализ прочитанного, начиная с простых вопросов.</li>
  <li>Применять интерактивные методы обучения, такие как групповые обсуждения, для улучшения навыков применения знаний.</li>
</ul>
"""

POLOR_AREA_RECOMEND_TEXT[9584][RUS][200] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов. Данный результат является среднем уровнем. Учащиеся этого уровня показывают базовое понимание текста и способны извлекать основные идеи. Однако у них все еще могут возникать трудности с глубоким анализом информации и формированием обоснованных выводов. Они могут использовать информацию для решения простых задач, но их критическое мышление требует дальнейшего развития.

Рекомендации:
- Развивать навыки анализа текста и работы с несколькими источниками информации.
- Включать задания на более глубокое понимание текста, с анализом подтекста и мотивации персонажей.
- Активно использовать различные методы для тренировки критического мышления: обсуждения, дебаты, анализ новостей.
- Стимулировать использование знаний в контексте реальных жизненных ситуаций для повышения практической значимости.
"""

POLOR_AREA_RECOMEND_TEXT[9584][RUS][400] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов. Это хороший результат и является выше среднего.
Рекомендуется обратить основное внимание на:
- Совершенствование критического мышления и применения знаний.
- Предлагать учащимся тексты повышенной сложности: научные статьи, аналитические обзоры, публицистику.
- Развивать навыки аргументации и обоснования собственной позиции на основе прочитанного.
- Включать задания на выявление предвзятости и критическое осмысление информации.
- Организовывать обсуждения и дебаты на основе прочитанных текстов для стимулирования глубокого анализа.
- Поддерживать развитие самостоятельного чтения и исследовательских проектов.
"""


POLOR_AREA_COMMON_TEXT[9584][KAZ] = """
Оқу сауаттылығы оқушылардың мәтіндерді оқып, ақпаратты түсіну және интерпретациялау қабілеттерін, сондай-ақ оны өз білімдерін кеңейту, әртүрлі мақсаттарға жету және қоғам өміріне белсене қатысу үшін қолдану мүмкіндіктерін бағалауға бағытталған.

Оқу сауаттылығының негізгі аспектілері:
Мәтінді оқу және түсіну: Әдеби шығармалар, ғылыми мақалалар, жаңалықтар және басқа да материалдар сияқты әртүрлі мәтін түрлерін түсініп, интерпретациялау қабілеті.  

Ақпаратты талдау және синтездеу: Мәтінді талдау, негізгі идеяларды анықтау, әртүрлі дереккөздерден алынған ақпаратты салыстыру және байланыстыру дағдылары.  

Сын тұрғысынан ойлау: Оқылған ақпаратты сыни бағалау, көзқарастар мен бұрмалаушылықтарды тану және негізделген тұжырымдар жасау қабілеті.  

Білімді қолдану: Оқылған ақпаратты практикалық тапсырмаларды шешу, талқылауларға қатысу және негізделген шешімдер қабылдау үшін пайдалану.

Бағыттың мақсаттары:
1. Әртүрлі елдер мен аймақтардағы оқушылардың оқу дағдылары деңгейін анықтау.  
2. Оқу дағдыларын жақсарту үшін оқыту мен үйретудің ең тиімді стратегияларын талдау.  
3. Қоғам мен саясаткерлердің назарын оқу барысында сыни және аналитикалық ойлауды дамыту маңыздылығына аудару. 
"""

POLOR_AREA_RECOMEND_TEXT[9584][KAZ][0] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташа көрсеткіштен төмен. Бұл деңгейдегі оқушылар мәтінді түсінуде және ақпаратты интерпретациялауда айтарлықтай қиындықтарға тап болады. Олар оқығанының негізгі идеяларын толықтай шығара алмайды және ақпаратты талдау мен синтездеуде қиындықтар көреді. Сын тұрғысынан ойлау қабілеті әлсіз, сондықтан негізделген тұжырымдар жасау қиынға соғады. Оқылған ақпаратты практикалық тапсырмаларды шешуде қолдану шектеулі.

Ұсыныстар:
- Мәтінді түсінудің негізгі дағдыларын дамытуға көңіл бөлу.
- Негізгі идеяларды бөліп шығару дағдыларын жақсартуға арналған жаттығулар енгізу.
- Оқылғанды талдау мен сын тұрғысынан ойлауды дамыту үшін қарапайым сұрақтардан бастап жаттығулар қосу.
- Оқушылардың білімін практикада қолдануға арналған топтық талқылаулар сияқты интерактивті әдістерді қолдану.
"""

POLOR_AREA_RECOMEND_TEXT[9584][KAZ][200] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. Бұл нәтиже орташа көрсеткіш болып табылады. Бұл деңгейдегі оқушылар мәтінді негізгі мағынасын түсінеді және негізгі идеяларды шығара алады. Алайда, ақпаратты терең талдау мен негізделген тұжырымдар жасау кезінде әлі де қиындықтар туындауы мүмкін. Олар қарапайым тапсырмаларды шешу үшін ақпаратты пайдалана алады, бірақ сын тұрғысынан ойлау дағдылары әлі де дамытуды қажет етеді.

Ұсыныстар:
- Мәтінді талдау және бірнеше дереккөзден алынған ақпаратпен жұмыс істеу дағдыларын дамыту.
- Мәтіннің тереңірек мағынасын түсіну тапсырмаларын қосу, оның ішінде кейіпкерлердің мотивтері мен астарлы мағыналарын талдау.
- Сын тұрғысынан ойлау дағдыларын дамыту үшін түрлі әдістерді пайдалану: талқылаулар, дебаттар, жаңалықтар талдауы.
- Оқушылардың білімін нақты өмірлік жағдайларда қолдануға ынталандыру, практикалық маңыздылығын арттыру.
"""
POLOR_AREA_RECOMEND_TEXT[9584][KAZ][400] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. Бұл нәтиже орташа көрсеткіштен жоғары. Бұл деңгейдегі оқушылар жоғары оқу сауаттылығына ие, мәтіндерді түсіну және талдау дағдылары жақсы дамыған. Олар негізгі идеяларды бөліп шығара алады, түрлі дереккөздерден ақпаратты салыстырып, негізделген тұжырымдар жасай алады. Сын тұрғысынан ойлау қабілеті жақсы дамыған және оқушылар алған білімдерін әртүрлі тапсырмаларды шешуде тиімді қолдана алады.

Ұсыныстар:
- Әр түрлі мәтін түрлерімен жұмыс істеу дағдыларын тереңдету, оның ішінде күрделі ғылыми материалдар мен әдеби шығармалар.
- Оқушыларды сыни талқылауларға қатыстыруды ынталандырып, күрделі мәтіндерді талдауды дамыту үшін талқылауларды ұйымдастыру.
- Білімді нестандартты жағдайларда қолдануды қажет ететін күрделі тапсырмаларды әзірлеу.
- Академиялық тәуелсіздікті арттыру үшін жүйелі талдау мен синтез дағдыларын дамытуға назар аудару.
"""


POLOR_AREA_COMMON_TEXT[9587][KAZ] = POLOR_AREA_COMMON_TEXT[9584][KAZ]
POLOR_AREA_COMMON_TEXT[9587][RUS] = POLOR_AREA_COMMON_TEXT[9584][RUS]
POLOR_AREA_RECOMEND_TEXT[9587][KAZ] = POLOR_AREA_RECOMEND_TEXT[9584][KAZ]
POLOR_AREA_RECOMEND_TEXT[9587][RUS] = POLOR_AREA_RECOMEND_TEXT[9584][RUS]

# ----------------------------------------------------------------

POLOR_AREA_COMMON_TEXT[9585][RUS] = """
Математическая грамотность оценивает то, насколько хорошо учащиеся могут применять математические знания и навыки для решения реальных жизненных ситуаций и проблем.

Основные аспекты математической грамотности:
Математическое мышление: Способность решать задачи и интерпретировать данные, используя логическое и математическое мышление.

Использование математики в реальной жизни: Умение применять математические знания и методы для анализа повседневных ситуаций и принятия информированных решений.

Понимание математических концепций: Глубокое понимание основных математических понятий и принципов, таких как вероятность, статистика, геометрия и алгебра.

Уверенность в своих математических способностях: Способность уверенно использовать математические инструменты и средства для решения разнообразных задач.

Цели направления:
1) Определить уровень математической подготовки учащихся в разных странах и регионах.
2) Проанализировать, какие стратегии преподавания и обучения наиболее эффективны для повышения математической грамотности.
3) Повысить осведомленность общественности и политиков о важности математического образования для решения глобальных задач и улучшения качества жизни.
"""


POLOR_AREA_RECOMEND_TEXT[9585][RUS][0] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов. 
Данный результат является ниже среднего. Учащиеся с таким результатом испытывают значительные трудности при решении математических задач. Их математические знания и навыки недостаточны для применения в реальных жизненных ситуациях. Возможно, они не полностью понимают основные математические концепции и имеют ограниченную уверенность в своих способностях.

Рекомендации:
- Провести дополнительную работу по укреплению базовых математических знаний.
- Использовать практические примеры и задачи для улучшения связи теории и реальной жизни.
- Внедрить более интерактивные методы обучения для повышения интереса к математике.
- Проводить дополнительные занятия для повышения уверенности в использовании математических инструментов.
"""

POLOR_AREA_RECOMEND_TEXT[9585][RUS][200] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов. 
Данный результат является средним показателем. Учащиеся в этой группе демонстрируют средний уровень математической грамотности. Они могут решать основные задачи, однако сталкиваются с трудностями при применении математических знаний в более сложных или реальных ситуациях. Понимание математических концепций может быть поверхностным.
Рекомендации:
- Усилить внимание к более сложным концепциям и задачам, требующим аналитического подхода.
- Развивать навыки применения математики в реальной жизни через дополнительные примеры.
- Включить в учебный процесс больше задач, связанных с анализом и интерпретацией данных.
- Повысить уровень уверенности учащихся через регулярную практику и поддержку.
"""

POLOR_AREA_RECOMEND_TEXT[9585][RUS][400] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов. 
Данный результат является выше среднего. Учащиеся этой группы продемонстрировали высокий уровень математической грамотности. Они уверенно решают задачи, анализируют и интерпретируют данные, а также применяют математические знания в реальных ситуациях. Они хорошо понимают основные математические концепции и уверенно используют математические инструменты.

Рекомендации:
- Продолжить развивать их математические способности с помощью более сложных и многозадачных задач.
- Включать в обучение задачи, требующие междисциплинарного подхода, например, использование математики в экономике или науке.
- Развивать критическое мышление через задачи, которые требуют анализа и принятия решений на основе математических данных.
- Предоставить дополнительные возможности для углубленного изучения математики, например, участие в олимпиадах и конкурсах.
"""


POLOR_AREA_COMMON_TEXT[9585][KAZ] = """
Математикалық сауаттылық – оқушылардың математикалық білімдері мен дағдыларын өмірдегі нақты жағдайлар мен мәселелерді шешу үшін қаншалықты тиімді қолдана алатынын бағалайды.  

Математикалық сауаттылықтың негізгі аспектілері:  
Математикалық ойлау: Логикалық және математикалық ойлауды қолданып, есептерді шешу және деректерді түсіндіру қабілеті.  

Математиканы өмірде қолдану: Күнделікті жағдайларды талдау және дұрыс шешім қабылдау үшін математикалық білімдер мен әдістерді қолдану дағдысы.  

Математикалық ұғымдарды түсіну: Ықтималдық, статистика, геометрия және алгебра сияқты негізгі математикалық ұғымдар мен қағидаларды терең түсіну.  

Математикалық қабілетке сенімділік: Әртүрлі есептерді шешу үшін математикалық құралдар мен әдістерді сенімді түрде қолдану дағдысы.  

Бағыттың мақсаты:
1) Әртүрлі елдер мен аймақтардағы оқушылардың математикалық дайындық деңгейін анықтау.  
2) Математикалық сауаттылықты арттыру үшін ең тиімді оқыту мен оқыту стратегияларын талдау.  
3) Ғаламдық мәселелерді шешу және өмір сапасын жақсарту үшін математикалық білімнің маңыздылығы туралы қоғам мен саясаткерлердің хабардарлығын арттыру.  
"""

POLOR_AREA_RECOMEND_TEXT[9585][KAZ][0] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташа көрсеткіштен төмен. Бұл нәтиже көрсеткен оқушылар математикалық тапсырмаларды шешуде айтарлықтай қиындықтар көреді. Олардың математикалық білімдері мен дағдылары күнделікті өмірде қолдану үшін жеткіліксіз. Математикалық ұғымдарды толық түсінбеуі мүмкін және өз қабілеттеріне сенімділік төмен.

Ұсыныстар:
- Негізгі математикалық білімдерді нығайту үшін қосымша жұмыс жүргізу.
- Теория мен практика арасындағы байланысты нығайту үшін нақты мысалдар мен тапсырмаларды пайдалану.
- Математикаға қызығушылықты арттыру үшін интерактивті оқыту әдістерін енгізу.
- Математикалық құралдарды пайдалану сенімділігін арттыру үшін қосымша сабақтар өткізу.
"""

POLOR_AREA_RECOMEND_TEXT[9585][KAZ][200] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл топтағы оқушылар орташа математикалық сауаттылық деңгейін көрсетеді. Олар негізгі тапсырмаларды шеше алады, бірақ күрделі немесе нақты өмір жағдайларында математикалық білімдерін қолдануда қиындықтар туындауы мүмкін. Математикалық ұғымдарды түсіну терең емес болуы мүмкін.

Ұсыныстар:
- Күрделі тұжырымдар мен тапсырмаларды түсінуге көбірек назар аудару.
- Математиканы күнделікті өмірде қолдану дағдыларын жетілдіру үшін қосымша мысалдар арқылы оқытуды дамыту.
- Деректерді талдау мен түсіндіруге бағытталған тапсырмаларды оқыту.
- Оқушылардың өзіне деген сенімділігін арттыру үшін жүйелі түрде жаттығулар мен қолдау көрсету.
"""
POLOR_AREA_RECOMEND_TEXT[9585][KAZ][400] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташадан жоғары. Бұл топтағы оқушылар математикалық сауаттылық деңгейі жоғары екенін көрсетті. Олар тапсырмаларды сенімді түрде шешеді, деректерді талдайды және математикалық білімдерін нақты өмір жағдайларында қолдана алады. Негізгі математикалық ұғымдарды жақсы түсінеді және математикалық құралдарды еркін пайдаланады.

Ұсыныстар:
- Олардың математикалық қабілеттерін күрделі және көпқадамды тапсырмалар арқылы одан әрі дамыту.
- Математиканы экономика немесе ғылым сияқты салаларда қолдану арқылы оқу процесіне көп салалы тапсырмаларды енгізу.
- Математикалық деректерді негізге ала отырып шешім қабылдау дағдыларын дамыту үшін сыни ойлау тапсырмаларын енгізу.
- Оқушыларға математиканы тереңдетіп оқыту мүмкіндіктерін ұсыну, мысалы, олимпиадалар мен байқауларға қатысу.
"""


POLOR_AREA_COMMON_TEXT[9589][KAZ] = POLOR_AREA_COMMON_TEXT[9585][KAZ]
POLOR_AREA_COMMON_TEXT[9589][RUS] = POLOR_AREA_COMMON_TEXT[9585][RUS]
POLOR_AREA_RECOMEND_TEXT[9589][KAZ] = POLOR_AREA_RECOMEND_TEXT[9585][KAZ]
POLOR_AREA_RECOMEND_TEXT[9589][RUS] = POLOR_AREA_RECOMEND_TEXT[9585][RUS]



# ----------------------------------------------------------------

POLOR_AREA_COMMON_TEXT[9586][RUS] = """
Естественнонаучная грамотность направлена на определение способности учащихся применять естественнонаучные знания и навыки для решения реальных жизненных проблем и задач.
Основные аспекты естественнонаучной грамотности:
Научное мышление: Способность формулировать гипотезы, проводить наблюдения и эксперименты, анализировать данные и делать выводы на основе научных принципов.

Интерпретация данных: Умение анализировать и интерпретировать научные данные, графики и таблицы, а также использовать их для объяснения природных явлений и процессов.

Применение науки в повседневной жизни: Понимание того, как научные принципы применяются в повседневной жизни, и использование этой информации для принятия обоснованных решений.

Глобальное научное сознание: Осознание глобальных экологических и социальных проблем, понимание роли науки в их решении и участие в обсуждении этих вопросов.

Цели направления:
1) Определить уровень естественнонаучных знаний и навыков учащихся в разных странах и регионах.
2) Проанализировать, какие стратегии преподавания и обучения наиболее эффективны для улучшения уровня естественнонаучной грамотности.
3) Повысить осведомленность общественности и политиков о важности естественнонаучного образования в контексте глобальных вызовов.
"""

POLOR_AREA_RECOMEND_TEXT[9586][RUS][0] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов.
Данный результат является ниже среднего. Учащиеся с таким результатом показывают низкий уровень естественнонаучной грамотности. Они испытывают трудности с пониманием научных принципов и не могут эффективно применять полученные знания в реальной жизни. Их навыки анализа научных данных и интерпретации графиков и таблиц требуют значительных улучшений.

Рекомендации:
- Разработать программы для улучшения базовых научных знаний.
- Уделить внимание развитию критического мышления через простые наблюдения и эксперименты.
- Внедрить методы визуализации данных для упрощения восприятия информации.
- Обсудить примеры повседневных ситуаций, где наука может быть полезна, чтобы учащиеся могли лучше связать теорию с практикой.
"""
POLOR_AREA_RECOMEND_TEXT[9586][RUS][200] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов.
Данный результат является средним показателем. Учащиеся этого уровня показывают средний результат, имея базовые навыки в области естественнонаучной грамотности. Они способны проводить простые наблюдения и эксперименты, но часто испытывают трудности с более сложным анализом и интерпретацией научных данных. Могут понимать основные научные принципы и их применение в повседневной жизни, но это требует дополнительных усилий для более глубокого осмысления.

Рекомендации:
- Усилить внимание к анализу и интерпретации данных, используя разнообразные научные примеры.
- Внедрить задачи, которые развивают способность формулировать гипотезы и делать выводы.
- Поддержать вовлеченность учащихся в обсуждения глобальных экологических и социальных проблем.
- Разработать больше практических заданий, связанных с реальными научными задачами.
"""
POLOR_AREA_RECOMEND_TEXT[9586][RUS][400] = """
Учащиеся в среднем набрали {} из максимально возможных 600 баллов.
Данный результат является выше среднего. Учащиеся, набравшие этот результат, обладают хорошими знаниями в области естественнонаучной грамотности. Они могут эффективно анализировать и интерпретировать научные данные, понимать основные научные принципы и применять их в повседневной жизни. Также они способны осознавать глобальные проблемы и обсуждать роль науки в их решении.

Рекомендации:
- Развивать навыки научного мышления через сложные эксперименты и исследования.
- Стимулировать участие в более глубоких дискуссиях по вопросам глобальных вызовов.
- Поддержать участие в научных проектах и инициативах, которые способствуют решению реальных проблем.
- Использовать их знания для создания инновационных решений и применения научных принципов на практике.
"""


POLOR_AREA_COMMON_TEXT[9586][KAZ] = """
Жаратылыстану сауаттылығы оқушылардың жаратылыстану бойынша білімдері мен дағдыларын шынайы өмірлік мәселелер мен міндеттерді шешуге қолдану қабілетін анықтауға бағытталған.  
Жаратылыстану сауаттылығының негізгі аспектілері:  
Ғылыми ойлау: Гипотезаларды тұжырымдау, бақылаулар мен тәжірибелер жүргізу, деректерді талдау және ғылыми қағидаларға сүйене отырып қорытынды жасау қабілеті.  

Деректерді интерпретациялау: Ғылыми деректерді, графиктер мен кестелерді талдау және интерпретациялау, сондай-ақ оларды табиғи құбылыстар мен процестерді түсіндіру үшін қолдану дағдысы.

Ғылымды күнделікті өмірде қолдану: Ғылыми қағидалардың күнделікті өмірде қалай қолданылатынын түсіну және осы ақпаратты негізделген шешімдер қабылдау үшін пайдалану.  

Ғаламдық ғылыми сана: Ғаламдық экологиялық және әлеуметтік мәселелерді түсіну, ғылымның оларды шешудегі рөлін ұғыну және осы мәселелерді талқылауға белсенді қатысу.  

Бағыттың мақсаттары:  
1) Әртүрлі елдер мен өңірлердегі оқушылардың жаратылыстану білімдері мен дағдыларының деңгейін анықтау.  
2) Жаратылыстану сауаттылығын арттыру үшін тиімді оқыту және үйрету стратегияларын талдау.  
3) Қоғам мен саясаткерлердің назарын ғаламдық сын-қатерлер аясында жаратылыстану білімінің маңыздылығына аудару. 
"""

POLOR_AREA_RECOMEND_TEXT[9586][KAZ][0] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташа көрсеткіштен төмен. Мұндай нәтижемен оқушылар табиғи ғылымдардан негізі түсініктер мен білімдерді меңгеруде қиындықтарға тап болады. Олар ғылыми принциптерді түсіну мен нақты өмірде қолдануда шектеулі қабілеттерге ие. Ғылыми деректерді талдау мен оларды түсіндіру дағдылары айтарлықтай жетілмеген.

Ұсыныстар:
- Негізгі ғылыми білімдерге ерекше назар аудару.
- Ғылыми ойлауды дамытуға арналған қарапайым эксперименттер мен бақылауларды енгізу.
- Ғылыми деректерді визуализациялау арқылы оқушылардың ақпаратты жеңіл қабылдауын қамтамасыз ету.
- Күнделікті өмірде ғылымның рөлі туралы түсініктер беру.
"""
POLOR_AREA_RECOMEND_TEXT[9586][KAZ][200] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташа көрсеткіш болып табылады. Бұл деңгейдегі оқушылар ғылыми сауаттылық бойынша орташа нәтиже көрсетеді. Олар ғылыми принциптерді негізінен түсініп, қарапайым тәжірибелерді жасау қабілетіне ие, бірақ ғылыми деректерді талдау мен интерпретациялауда қиындықтар туындауы мүмкін.

Ұсыныстар:
- Ғылыми деректерді талдауды әрі интерпретациялауды жетілдіруге назар аудару.
- Гипотезаларды құру мен тұжырымдар жасау дағдыларын дамыту.
- Экологиялық және әлеуметтік мәселелер бойынша пікірталастарға қатысуға шақыру.
- Ғылыми негіздер мен теорияларды күнделікті өмірдегі тапсырмаларға байланыстыра отырып, іс-тәжірибе жұмыстарын ұйымдастыру.
"""
POLOR_AREA_RECOMEND_TEXT[9586][KAZ][400] = """
Оқушылар орта есеппен максималды 600 баллдан {} балл жинады. 
Бұл нәтиже орташа көрсеткіштен жоғары. Бұл оқушылар табиғи ғылымдар саласындағы жақсы білімдермен және дағдылармен қаруланған. Олар ғылыми деректерді тиімді талдай алады, ғылыми принциптерді күнделікті өмірде қолданады және ғаламдық мәселелер мен ғылымның рөлі туралы белсенді түрде пікір білдіреді.

Ұсыныстар:
- Ғылыми ойлауды жетілдіруге арналған күрделі зерттеулер мен тәжірибелер ұйымдастыру.
- Ғаламдық экологиялық және әлеуметтік мәселелер бойынша терең талқылауларға қатыстыру.
- Ғылымды шешімдер қабылдауға, ғылыми жобалар мен бастамаларға қатысу арқылы қолдануды ынталандыру.
"""


POLOR_AREA_COMMON_TEXT[9590][KAZ] = POLOR_AREA_COMMON_TEXT[9586][KAZ]
POLOR_AREA_COMMON_TEXT[9590][RUS] = POLOR_AREA_COMMON_TEXT[9586][RUS]
POLOR_AREA_RECOMEND_TEXT[9590][KAZ] = POLOR_AREA_RECOMEND_TEXT[9586][KAZ]
POLOR_AREA_RECOMEND_TEXT[9590][RUS] = POLOR_AREA_RECOMEND_TEXT[9586][RUS]