from django.utils.translation import get_language


__NIS_LANGUAGE_TEXTS = {
    "kk": """
    """,
    "ru": """
<p class="mb-10">Это Ваш результат по данному предмету из 200 возможных баллов. Расчет баллов произведен в зависимости от сложности каждого тестового вопроса.</p>
    """,
}
RESULT_MAIN_DESCRIPTION_TEXTS = {
    9540: {
        "kk": """
        """,
        "ru": """
<p class="mb-10">Это Ваш результат по данному предмету из 400 возможных баллов. Расчет баллов произведен в зависимости от сложности каждого тестового вопроса. Далее представлен подробный анализ результата по разделам предмета.</p>
        """,
    },
    9541: __NIS_LANGUAGE_TEXTS,
    9542: __NIS_LANGUAGE_TEXTS,
    9543: __NIS_LANGUAGE_TEXTS,
    9544: {
        "kk": """
        """,
        "ru": """
<p class="mb-10">Это Ваш результат по данному предмету из 60 возможных баллов. Расчет баллов произведен в зависимости от сложности каждого тестового вопроса. Далее представлен подробный анализ результата по разделам предмета.</p>
        """,
    },
}

def result_main_description_text(section_id):
    if section_id not in RESULT_MAIN_DESCRIPTION_TEXTS:
        return ""
    return RESULT_MAIN_DESCRIPTION_TEXTS[section_id][get_language()]


RESULT_TOPIC_DESCRIPTION_TEXTS = {
    5156: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Отношение двух чисел. Процентное отношение двух чисел. Пропорция. Основное свойство пропорции. Прямая пропорциональная зависимость. Обратная пропорциональная зависимость. Решение текстовых задач с помощью пропорции. Масштаб. Длина окружности. Площадь круга. Шар. Сфера.</p>
        """,
    },
    5157: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Положительные числа. Отрицательные числа. Координатная прямая. Противоположные числа. Целые числа. Рациональные числа. Модуль числа. Сравнение рациональных чисел. Сложение рациональных чисел с помощью координатной прямой. Сложение отрицательных рациональных чисел. Сложение рациональных чисел с разными знаками. Вычитание рациональных чисел. Расстояние между точками на координатной прямой.</p>
        """,
    },
    5158: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие модуля числа. Нахождение модуля числа. Понятие геометрического смысла модуля разности. Нахождение расстояния на координатной прямой.</p>
        """,
    },
    5159: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие уравнения и неравенства. Решение уравнений. Свойства верных числовых равенств. Свойства числовых неравенств. Линейное уравнение с одной переменной. Понятие числовых промежутков. Решение линейных уравнений и неравенств. Понятие системы уравнений. Решение системы уравнений способом подстановки и сложения.</p>
        """,
    },
    5160: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Преобразование буквенных выражений. Понятие алгебраического выражения. Вычисление значений алгебраических выражений. Правила раскрытия скобок. Понятие подобных слагаемых. Понятие тождества и тождественных преобразований. Выполнение тождественных преобразований алгебраических выражений.</p>
        """,
    },
    5161: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Делимость натуральных чисел. Свойства арифметических действий. Арифметические действия над обыкновенными и десятичными дробями.</p>
        """,
    },
    5162: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие процента. Нахождение процентов от числа и числа по его процентам. Перевод дробей в проценты, перевод процентов в дроби.</p>
        """,
    },
    5163: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие о геометрических фигурах. Понятие симметрии и ее видов. Понятие координатной плоскости, прямоугольной системы координат, осей координат. Определение пересекающихся, параллельных и перпендикулярных прямых. Нахождение расстояния между точками. Определение вектора. Нахождение площадей геометрических фигур. Понятие угла, его видов. Нахождение угла, определение соотношений между углами.</p>
        """,
    },
    5164: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Переменная. Выражение с переменной. Раскрытие скобок. Коэффициент. Подобные слагаемые. Приведение подобных слагаемых. Тождественные преобразования выражений. Тождество. Преобразования алгебраических выражений. Решение текстовых задач.</p>
        """,
    },
    5165: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие множества чисел. Понятие четных и нечетных чисел. Определение степени числа. Определение делителя числа. Понятие общего делителя, общего кратного чисел. Понятие простого и составного числа. Операции над числами.</p>
        """,
    },
    5166: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Преобразование дробей. Приведение дробей к общему знаменателю. Основное свойство дроби при сокращении дробей. Сложение и вычитание дробей с одинаковыми знаменателями. Сложение и вычитание дробей с разными знаменателями. Сложение и вычитание дробей и натуральных чисел.</p>
        """,
    },
    5167: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие единиц измерения. Измерение массы, длины. Сравнение различных измерений.</p>
        """,
    },
    5168: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Положительные числа. Отрицательные числа. Деление чисел. Деление смешанных чисел. Арифметические операции между натуральными и рациональными числами.</p>
        """,
    },
    5169: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие выражений. Понятие уравнений. Решение уравнений. Преобразование выражений.</p>
        """,
    },
    5170: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие функции. Понятие аргумента и значения функции. Понятие области определения функции. Решение задач на нахождение значения функции, аргумента функции, области определения функции.</p>
        """,
    },
    5171: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Решение задач с помощью математического моделирования. Математический язык и математическая модель.</p>
        """,
    },
    5172: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие множества и его элементов. Понятие пустого множества. Понятие объединения и пересечения множеств. Понятие подмножества.</p>
        """,
    },
    5173: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Понятие последовательности. Решение задач на нахождение закономерностей в последовательности.</p>
        """,
    },
    5174: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Статистические данные и их характеристики: среднее арифметическое, мода, медиана, размах. Решение задач на нахождение средней скорости движения.</p>
        """,
    },
    5175: {
        "kk": """
        """,
        "ru": """
<p class="mt-5 mb-10">Решение комбинаторных задач методом перебора.</p>
        """,
    },
}

def result_topic_description_text(topic_id):
    if topic_id not in RESULT_TOPIC_DESCRIPTION_TEXTS:
        return ""
    return RESULT_TOPIC_DESCRIPTION_TEXTS[topic_id][get_language()]
