__UNT_COMPULSORY_INSTRUCTION_TEXT = {
    "kk": [
        [
            "Бұл пән бойынша 20 сұрақ берілген.",
            "Сұрақтарға жауап беру уақыты 40 минут.",
            "Жауаптарды мұқиат тексеріңіз.",
        ],
    ],
    "ru": [
        [
            "Данный предмет содержит 20 вопросов.",
            "Для ответа на все вопросы выделено 40 минут.",
            "Не забудьте перепроверить свои ответы.",
        ],
    ],
}
__UNT_PROFILE_INSTRUCTION_TEXT = {
    "kk": [
        [
            "Бұл пән бойынша бір дұрыс жауабы бар 20 сұрақ және бір немесе бірнеше дұрыс жауабы бар 10 сұрақ берілген.",
            "Сұрақтарға жауап беру уақыты 60 минут.",
            "Жауаптарды мұқиат тексеріңіз.",
        ],
    ],
    "ru": [
        [
            "Данный предмет содержит 20 вопросов с выбором одного правильного ответа и 10 вопросов с выбором одного или нескольких правильных ответов.",
            "Для ответа на все вопросы выделено 60 минут.",
            "Не забудьте перепроверить свои ответы.",
        ],
    ],
    # DARK_TODO  implement this!
    "en": [
        [
            "",
            "",
            "",
        ],
    ],
    "fr": [
        [
            "",
            "",
            "",
        ],
    ],
    "de": [
        [
            "",
            "",
            "",
        ],
    ],
}
__NIS_LANGUAGES_INSTRUCTION_TEXT = {
    "kk": [
        [
            "Бұл пән бойынша 10 мәтінге 20 сұрақ берілген.",
            "Сұрақтарға жауап беру уақыты 40 минут.",
            "Жауаптарды мұқиат тексеріңіз.",
        ],
    ],
    "ru": [
        [
            "Данный предмет содержит 10 текстов и 20 вопросов к ним.",
            "Для ответа на все вопросы выделено 40 минут.",
            "Не забудьте перепроверить свои ответы.",
        ],
    ],
    # DARK_TODO  implement this!
    "xx": [
        [
            "",
            "",
            "",
        ],
    ],
}

TEST_INSTRUCTION_TEXTS = {
    9540: {
        "kk": [
            [
                "Бұл пән бойынша 40 сұрақ берілген.",
                "Сұрақтарға жауап беру уақыты 60 минут.",
                "Жауаптарды мұқиат тексеріңіз.",
            ],
        ],
        "ru": [
            [
                "Данный предмет содержит 40 вопросов.",
                "Для ответа на все вопросы выделено 60 минут.",
                "Не забудьте перепроверить свои ответы.",
            ],
        ],
    },
    9541: {
        "kk": __NIS_LANGUAGES_INSTRUCTION_TEXT["kk"],
        "ru": __NIS_LANGUAGES_INSTRUCTION_TEXT["kk"],
    },
    9542: {
        "kk": __NIS_LANGUAGES_INSTRUCTION_TEXT["ru"],
        "ru": __NIS_LANGUAGES_INSTRUCTION_TEXT["ru"],
    },
    9543: {
        "xx": __NIS_LANGUAGES_INSTRUCTION_TEXT["xx"],
    },
    9544: {
        "kk": [
            [
                "Бұл пән бойынша әрбір сұрақ екі бөліктен тұрады. А қатарында тапсырманың бірінші бөлігі орналасқан, ал В қатарында тапсырманың екінші бөлігі орналасқан.",
            ],
            [
                "Сіз бірінші қатардағы тапсырманың мәні екінші қатардағы мәнге қарағанда үлкен немесе тең екенін, не болмаса берілген тапсырмаға жауап беру үшін ақпарат жеткіліксіз екенін көрсетуіңіз қажет:",
            ],
            [
                "Егер А қатарындағы мән үлкен болса, онда А жауабын;",
                "Егер В қатарындағы мән үлкен болса, онда В жауабын;",
                "Егер екі мән өзара тең болса, онда С жауабын;",
                "Егер тапсырмаға жауап беру үшін ақпарат жеткіліксіз болса, онда D жауабын таңдаңыз.",
            ],
            [
                "Бұл пән бойынша 60 сұрақ берілген.",
                "Сұрақтарға жауап беру уақыты 30 минут.",
                "Жауаптарды мұқиат тексеріңіз.",
            ],
        ],
        "ru": [
            [
                "В данном разделе каждый вопрос состоит из двух частей. Первая часть расположена в колонке А. Вторая часть расположена в колонке В.",
            ],
            [
                "Вам необходимо определить, в какой колонке значение больше, равны ли значения в обеих колонках или недостаточно информации. Выберите ответ:",
            ],
            [
                "А, если значение в колонке А больше;",
                "В, если значение в колонке В больше;",
                "С, если оба значения равны между собой;",
                "D, если недостаточно информации.",
            ],
            [
                "Данный предмет содержит 60 вопросов.",
                "Для ответа на все вопросы выделено 30 минут.",
                "Не забудьте перепроверить свои ответы.",
            ],
        ],
    },

    9547: __UNT_COMPULSORY_INSTRUCTION_TEXT,
    9546: __UNT_COMPULSORY_INSTRUCTION_TEXT,
    9545: __UNT_COMPULSORY_INSTRUCTION_TEXT,

    9548: __UNT_PROFILE_INSTRUCTION_TEXT,
    9549: __UNT_PROFILE_INSTRUCTION_TEXT,
    9550: __UNT_PROFILE_INSTRUCTION_TEXT,
    9551: __UNT_PROFILE_INSTRUCTION_TEXT,
    9552: __UNT_PROFILE_INSTRUCTION_TEXT,
    9553: __UNT_PROFILE_INSTRUCTION_TEXT,
    9554: {
        "xx": __UNT_PROFILE_INSTRUCTION_TEXT["en"],
    },
    9555: {
        "xx": __UNT_PROFILE_INSTRUCTION_TEXT["fr"],
    },
    9556: {
        "xx": __UNT_PROFILE_INSTRUCTION_TEXT["de"],
    },
    9557: {
        "kk": __UNT_PROFILE_INSTRUCTION_TEXT["kk"],
        "ru": __UNT_PROFILE_INSTRUCTION_TEXT["kk"],
    },
    9558: {
        "kk": __UNT_PROFILE_INSTRUCTION_TEXT["ru"],
        "ru": __UNT_PROFILE_INSTRUCTION_TEXT["ru"],
    },
    9559: __UNT_PROFILE_INSTRUCTION_TEXT,
}
