from django.conf import settings


AGREEMENT_TEXTS = {
    "09b90737225eb2551d9e9344bbb68ba0": {
        "kk": """
        """,
        "ru": """
<h6 class="mt-15 mb-10"><span class="text-left mr-5">1.</span>ОБЩИЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.1</span>Настоящая публичная оферта является официальным предложением ТОО «BBMINDS», БИН 171040002110 (далее – Заказчик) заключить договор по разработке тестовых вопросов для пробного тестирования (далее – Оферта) на сайте www.bbtest.kz (далее – Веб-сайт) с любыми совершеннолетними лицами, которые подтвердили свое полное и безоговорочное согласие с условиями настоящей Оферты, зарегистрировались на Веб-сайте и получили доступ к личному кабинету, путем заполнения анкеты Заказчика (далее – Разработчик).</p>
<p class="text-justify text-normal mb-10">В соответствии со статьями 395 – 399 Гражданского кодекса Республики Казахстан, принятие и подтверждение Разработчиком своего полного и безоговорочного согласия с условиями настоящей Оферты равносильно заключению договора публичной оферты (далее – Договор) на условиях, изложенных в настоящем документе.</p>
<p class="text-justify text-normal mb-10">В СВЯЗИ С ВЫШЕИЗЛОЖЕННЫМ, ВНИМАТЕЛЬНО ОЗНАКОМЬТЕСЬ С ТЕКСТОМ НАСТОЯЩЕГО ДОКУМЕНТА. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С КАКИМ-ЛИБО ПУНКТОМ ОФЕРТЫ, ЗАКАЗЧИК ПРЕДЛАГАЕТ ВАМ ОТКАЗАТЬСЯ ОТ РЕГИСТРАЦИИ НА ВЕБ-САЙТЕ.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.2</span>Оферта считается принятой Разработчиком полностью и безоговорочно и договор заключенным между Заказчиком и Разработчиком, совместно именуемыми Сторонами с момента выполнения Разработчиком совокупности следующих действий:<br>1) Регистрация на Веб-сайте путем заполнения личных данных;<br>2) Отправка тестовых вопросов на рассмотрение Заказчику через Веб-сайт.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">2.</span>ПРЕДМЕТ ДОГОВОРА</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.1</span>По настоящему Договору Разработчик обязуется оказать услуги по разработке тестовых вопросов для пробного тестирования на Веб-сайте (далее – Услуги), а Заказчик оплатить Услуги в соответствии с условиями настоящего Договора.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.2</span>Услуги считаются оказанными после проведения Заказчиком проверки содержания тестовых вопросов на соответствие тестовой спецификации по предмету/разделу пробного тестирования, находящейся на Веб-сайте, (далее – Экспертиза).</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">2.3</span>Сроки проведения Проверки устанавливает Заказчик. Сроки завершения Проверки не должны превышать 3 месяцев со дня отправки Разработчиком последнего тестового вопроса.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">3.</span>СТОИМОСТЬ ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.1</span>Согласно условиям настоящего Договора Заказчик обязуется оплатить 300 (триста) тенге за 1 (один) тестовый вопрос, прошедшего экспертизу Заказчика.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.2</span>Стоимость Договора не включает в себя налог на добавленную стоимость.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.3</span>Оплата за осуществление Услуг производится путем перечисления денежных средств на банковский счет Разработчика, указанного при регистрации на Веб-сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.4</span>Оплата за осуществление Услуг производится только в безналичной форме. Любые банковские комиссии при получении оплаты от Заказчика оплачиваются Разработчиком за свой счет.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">3.5</span>Сроки оплаты за осуществление Услуг устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">4.</span>ОБЯЗАННОСТИ СТОРОН</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1</span>Заказчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.1</span>Оплатить Услуги в соответствии с условиями настоящего Договора;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.2</span>Не разглашать и не передавать третьим лицам сведения о Разработчике;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.3</span>Оповестить Разработчика о любых изменениях в условиях настоящего Договора путем опубликования на Веб-сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2</span>Разработчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.1</span>Предоставить достоверную информацию о себе в личном кабинете Веб-сайта;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.2</span>Предоставить Заказчику копии документов, подтверждающих специальные знания и профессиональные навыки Разработчика, для предоставления Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.3</span>Соблюдать Законы РК при предоставлении Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.4</span>Не нарушать авторское право третьих лиц при предоставлении Услуг в том числе не копировать тестовые вопросы и/или тексты с официальных источников организаций образования;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.5</span>Качественно предоставить Услуги Заказчику согласно техническому заданию (Приложение);</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">4.2.6</span>Передать авторские права на предоставляемые Услуги Заказчику.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">5.</span>ОТВЕТСТВЕННОСТЬ СТОРОН И ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.1</span>Заказчик несет полную ответственность за достоверность данных указанных в заявке на участие в пробном тестировании.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.2</span>За исключением обстоятельств непреодолимой силы (форс-мажор) за неисполнение или ненадлежащее исполнение обязательств по настоящему Договору Стороны несут ответственность в соответствии с действующим законодательством Республики Казахстан.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">5.3</span>Споры и разногласия, которые могут возникать при исполнении настоящего Договора, будут по возможности разрешаться путем переговоров между Сторонами.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">6.</span>ФОРС-МАЖОР</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">6.1</span>Стороны не несут ответственность за неисполнение условий Договора, если оно явилось результатом форс-мажорных обстоятельств.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">6.2</span>«Форс-мажор» означает событие, неподвластное контролю Сторон, и имеющее непредвиденный характер. Такие события могут включать: военные действия, природные или стихийные бедствия и другие.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">7.</span>ПРОЧИЕ УСЛОВИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">7.1</span>Договор вступает в силу с момента принятия настоящей Оферты Разработчиком путем регистрации на Веб-сайте и действует до полного его исполнения Сторонами своих обязательств.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">7.2</span>Разработчик не вправе привлекать для выполнения своих обязательств по Договору третьих лиц без согласования с Заказчиком.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">7.3</span>В случае возникновения вопросов Разработчик вправе обратиться к Заказчику через Веб-сайт.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">8.</span>ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.1</span>Настоящая Оферта вступает в силу с момента регистрации Разработчика на Веб-сайте и действует до оказания Услуг Разработчиком.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.2</span>Заказчик оставляет за собой право внести изменения в условия настоящей Оферты или отозвать Оферту в любой момент по своему усмотрению. Датой вступления в силу изменений настоящей Оферты является дата опубликования на Веб-сайте Оферты или информации об отзыве Оферты.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.3</span>Принимая условия настоящей Оферты путем ее акцепта, Заказчик подтверждает, что заключает Договор добровольно и соглашается со всеми условиями, изложенными в Оферте.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">8.4</span>Настоящая Оферта составлена в единственном экземпляре и опубликована на Веб-сайте.</p>
        """,
    },
    "928d4499e9f1e6b90111710ecf607795": {
        "kk": """
        """,
        "ru": """
<h6 class="mt-15 mb-10"><span class="text-left mr-5">1.</span>ОБЩИЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.1.</span>Настоящая публичная оферта является официальным предложением ТОО &laquo;BBMINDS&raquo;, БИН 171040002110 (далее – Заказчик) заключить договор по разработке тестовых вопросов для пробного тестирования (далее – Оферта) на веб-сайте <a href="%s">bbtest.kz</a> (далее – Сайт) с любыми совершеннолетними лицами, которые подтвердили свое полное и безоговорочное согласие с условиями настоящей Оферты, зарегистрировались на Сайте путем заполнения личных данных (далее – Разработчик).</p>
<p class="text-justify text-normal mb-10">В соответствии со статьями 395 – 399 Гражданского кодекса Республики Казахстан, принятие и подтверждение Разработчиком своего полного и безоговорочного согласия с условиями настоящей Оферты равносильно заключению договора публичной оферты (далее – Договор) на условиях, изложенных в настоящем документе.</p>
<p class="text-justify text-normal mb-10">В СВЯЗИ С ВЫШЕИЗЛОЖЕННЫМ, ВНИМАТЕЛЬНО ОЗНАКОМЬТЕСЬ С ТЕКСТОМ НАСТОЯЩЕГО ДОКУМЕНТА. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С КАКИМ-ЛИБО ПУНКТОМ ОФЕРТЫ, ЗАКАЗЧИК ПРЕДЛАГАЕТ ВАМ ОТКАЗАТЬСЯ ОТ РЕГИСТРАЦИИ НА САЙТЕ.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.2.</span>Оферта считается принятой Разработчиком полностью и безоговорочно и Договор заключенным между Заказчиком и Разработчиком, совместно именуемыми Сторонами с момента выполнения Разработчиком совокупности следующих действий:<br>1) Регистрация на Сайте путем заполнения личных данных;<br>2) Загрузка тестовых вопросов на Сайт для рассмотрения Заказчиком.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">2.</span>ПРЕДМЕТ ДОГОВОРА</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.1.</span>По настоящему Договору Разработчик обязуется оказать услуги по разработке тестовых вопросов для пробного тестирования на Сайте (далее – Услуги), а Заказчик оплатить Услуги в соответствии с условиями настоящего Договора.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.2.</span>Услуги считаются оказанными после проведения Заказчиком проверки содержания тестовых вопросов на соответствие тестовой спецификации по предмету/разделу пробного тестирования, находящейся на Сайте, (далее – Экспертиза).</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">2.3.</span>Сроки проведения Проверки устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">3.</span>СТОИМОСТЬ ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.1.</span>Согласно условиям настоящего Договора Заказчик обязуется оплатить 300 (триста) тенге за 1 (один) тестовый вопрос, имеющий положительный результат экспертизы Заказчика.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.2.</span>Стоимость Договора не включает в себя налог на добавленную стоимость.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.3.</span>Оплата за осуществление Услуг производится путем перечисления денежных средств на банковский счет Разработчика, указанного при регистрации на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.4.</span>Оплата за осуществление Услуг производится только в безналичной форме. Любые банковские комиссии при получении оплаты от Заказчика оплачиваются Разработчиком за свой счет.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">3.5.</span>Сроки оплаты за осуществление Услуг устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">4.</span>ОБЯЗАННОСТИ СТОРОН</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.</span>Заказчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.1.</span>Оплатить Услуги в соответствии с условиями настоящего Договора;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.2.</span>Не разглашать и не передавать третьим лицам сведения о Разработчике;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.3.</span>Оповестить Разработчика о любых изменениях в условиях настоящего Договора путем опубликования на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.</span>Разработчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.1.</span>Предоставить достоверную информацию о себе в личном кабинете Сайта;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.2.</span>Предоставить Заказчику копии документов, подтверждающих специальные знания и профессиональные навыки Разработчика, для предоставления Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.3.</span>Соблюдать Законы РК при предоставлении Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.4.</span>Не нарушать авторское право третьих лиц при предоставлении Услуг в том числе не копировать тестовые вопросы и/или тексты с официальных источников организаций образования;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.5.</span>Качественно предоставить Услуги Заказчику согласно Тестовой спецификации;</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">4.2.6.</span>Передать авторские права на предоставляемые Услуги Заказчику.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">5.</span>ОТВЕТСТВЕННОСТЬ СТОРОН И ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.1.</span>Заказчик несет полную ответственность за достоверность данных указанных в заявке на участие в пробном тестировании.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.2.</span>За исключением обстоятельств непреодолимой силы (форс-мажор) за неисполнение или ненадлежащее исполнение обязательств по настоящему Договору Стороны несут ответственность в соответствии с действующим законодательством Республики Казахстан.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">5.3.</span>Споры и разногласия, которые могут возникать при исполнении настоящего Договора, будут по возможности разрешаться путем переговоров между Сторонами.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">6.</span>ФОРС-МАЖОР</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">6.1.</span>Стороны не несут ответственность за неисполнение условий Договора, если оно явилось результатом форс-мажорных обстоятельств.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">6.2.</span>&laquo;Форс-мажор&raquo; означает событие, неподвластное контролю Сторон, и имеющее непредвиденный характер. Такие события могут включать: военные действия, природные или стихийные бедствия и другие.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">7.</span>ПРОЧИЕ УСЛОВИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">7.1.</span>Разработчик не вправе привлекать для выполнения своих обязательств по Договору третьих лиц без согласования с Заказчиком.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">7.2.</span>В случае возникновения вопросов Разработчик вправе обратиться к Заказчику через Сайт.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">8.</span>ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.1.</span>Настоящий Договор вступает в силу с момента регистрации Разработчика на Сайте и действует до полного исполнения Сторонами своих обязательств.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.2.</span>Заказчик оставляет за собой право вносить изменения в условия настоящего Договора или отозвать Оферту в любой момент по своему усмотрению. Датой вступления в силу изменений настоящей Оферты является дата опубликования на Сайте Оферты или информации об отзыве Оферты.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.3.</span>Принимая условия настоящей Оферты путем ее акцепта, Заказчик подтверждает, что заключает Договор добровольно и соглашается со всеми условиями, изложенными в Оферте.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">8.4.</span>Настоящая Оферта составлена в единственном экземпляре и опубликована на Сайте.</p>
        """ % settings.BB_BASE_URL,
    },
    "d16bb9fb5a2264c43ce4cdfc31ce1e75": {
        "kk": """
        """,
        "ru": """
<h6 class="mt-15 mb-10"><span class="text-left mr-5">1.</span>ОБЩИЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.1.</span>Настоящая публичная оферта является официальным предложением ТОО &laquo;BBMINDS&raquo;, БИН 171040002110 (далее – Заказчик) заключить договор по разработке тестовых вопросов для пробного тестирования (далее – Оферта) на веб-сайте <a href="%s">bbtest.kz</a> (далее – Сайт) с любыми совершеннолетними лицами, которые подтвердили свое полное и безоговорочное согласие с условиями настоящей Оферты, зарегистрировались на Сайте путем заполнения личных данных (далее – Разработчик).</p>
<p class="text-justify text-normal mb-10">В соответствии со статьями 395 – 399 Гражданского кодекса Республики Казахстан, принятие и подтверждение Разработчиком своего полного и безоговорочного согласия с условиями настоящей Оферты равносильно заключению договора публичной оферты (далее – Договор) на условиях, изложенных в настоящем документе.</p>
<p class="text-justify text-normal mb-10">В СВЯЗИ С ВЫШЕИЗЛОЖЕННЫМ, ВНИМАТЕЛЬНО ОЗНАКОМЬТЕСЬ С ТЕКСТОМ НАСТОЯЩЕГО ДОКУМЕНТА. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С КАКИМ-ЛИБО ПУНКТОМ ОФЕРТЫ, ЗАКАЗЧИК ПРЕДЛАГАЕТ ВАМ ОТКАЗАТЬСЯ ОТ РЕГИСТРАЦИИ НА САЙТЕ.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.2.</span>Оферта считается принятой Разработчиком полностью и безоговорочно и договор заключенным между Заказчиком и Разработчиком, совместно именуемыми Сторонами с момента выполнения Разработчиком совокупности следующих действий:<br>1) Регистрация на Сайте путем заполнения личных данных;<br>2) Загрузка тестовых вопросов на Сайт для рассмотрения Заказчиком.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">2.</span>ПРЕДМЕТ ДОГОВОРА</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.1.</span>По настоящему Договору Разработчик обязуется оказать услуги по разработке тестовых вопросов для пробного тестирования на Сайте (далее – Услуги), а Заказчик оплатить Услуги в соответствии с условиями настоящего Договора.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.2.</span>Услуги считаются оказанными после проведения Заказчиком проверки содержания тестовых вопросов на соответствие тестовой спецификации по предмету/разделу пробного тестирования, находящейся на Сайте, (далее – Экспертиза).</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">2.3.</span>Сроки проведения Проверки устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">3.</span>СТОИМОСТЬ ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.1.</span>Согласно условиям настоящего Договора Заказчик обязуется оплачивать определенную долю от общей вырученной суммы за 1 (один) тестовый вопрос в зависимости от количества продаж:</p>
<ul class="mb-0">
    <li>50%% от суммы при количестве от 1 до 1000 продаж;</li>
    <li>45%% от суммы при количестве от 1001 до 2000 продаж;</li>
    <li>40%% от суммы при количестве от 2001 до 3000 продаж;</li>
    <li>35%% от суммы при количестве от 3001 до 4000 продаж;</li>
    <li>30%% от суммы при количестве от 4001 до 5000 и более продаж.</li>
</ul>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.2.</span>Стоимость Договора не включает в себя налог на добавленную стоимость.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.3.</span>Оплата за осуществление Услуг производится путем перечисления денежных средств на банковский счет Разработчика, указанного при регистрации на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.4.</span>Оплата за осуществление Услуг производится только в безналичной форме. Любые банковские комиссии при получении оплаты от Заказчика оплачиваются Разработчиком за свой счет.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">3.5.</span>Сроки оплаты за осуществление Услуг устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">4.</span>ОБЯЗАННОСТИ СТОРОН</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.</span>Заказчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.1.</span>Оплатить Услуги в соответствии с условиями настоящего Договора;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.2.</span>Не разглашать и не передавать третьим лицам сведения о Разработчике;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.3.</span>Оповестить Разработчика о любых изменениях в условиях настоящего Договора путем опубликования на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.</span>Разработчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.1.</span>Предоставить достоверную информацию о себе в личном кабинете Сайта;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.2.</span>Предоставить Заказчику копии документов, подтверждающих специальные знания и профессиональные навыки Разработчика, для предоставления Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.3.</span>Соблюдать Законы РК при предоставлении Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.4.</span>Не нарушать авторское право третьих лиц при предоставлении Услуг в том числе не копировать тестовые вопросы и/или тексты с официальных источников организаций образования;</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">4.2.5.</span>Качественно предоставить Услуги Заказчику согласно Тестовой спецификации.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">5.</span>ОТВЕТСТВЕННОСТЬ СТОРОН И ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.1.</span>Заказчик несет полную ответственность за достоверность данных указанных в заявке на участие в пробном тестировании.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.2.</span>За исключением обстоятельств непреодолимой силы (форс-мажор) за неисполнение или ненадлежащее исполнение обязательств по настоящему Договору Стороны несут ответственность в соответствии с действующим законодательством Республики Казахстан.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">5.3.</span>Споры и разногласия, которые могут возникать при исполнении настоящего Договора, будут по возможности разрешаться путем переговоров между Сторонами.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">6.</span>ФОРС-МАЖОР</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">6.1.</span>Стороны не несут ответственность за неисполнение условий Договора, если оно явилось результатом форс-мажорных обстоятельств.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">6.2.</span>&laquo;Форс-мажор&raquo; означает событие, неподвластное контролю Сторон, и имеющее непредвиденный характер. Такие события могут включать: военные действия, природные или стихийные бедствия и другие.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">7.</span>ПРОЧИЕ УСЛОВИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">7.1.</span>Разработчик не вправе привлекать для выполнения своих обязательств по Договору третьих лиц без согласования с Заказчиком.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">7.2.</span>В случае возникновения вопросов Разработчик вправе обратиться к Заказчику через Сайт.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">8.</span>ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.1.</span>Настоящий Договор вступает в силу с момента регистрации Разработчика на Сайте и действует до полного исполнения Сторонами своих обязательств.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.2.</span>Заказчик оставляет за собой право вносить изменения в условия настоящего Договора или отозвать Оферту в любой момент по своему усмотрению. Датой вступления в силу изменений настоящей Оферты является дата опубликования на Сайте Оферты или информации об отзыве Оферты.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.3.</span>Принимая условия настоящей Оферты путем ее акцепта, Заказчик подтверждает, что заключает Договор добровольно и соглашается со всеми условиями, изложенными в Оферте.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">8.4.</span>Настоящая Оферта составлена в единственном экземпляре и опубликована на Сайте.</p>
        """ % settings.BB_BASE_URL,
    },
    "61011ada89570a6d41140a656fbbbd37": {
        "kk": """
        """,
        "ru": """
<h6 class="mt-15 mb-10"><span class="text-left mr-5">1.</span>ОБЩИЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.1.</span>Настоящая публичная оферта является официальным предложением ТОО &laquo;BBMINDS&raquo;, БИН 171040002110 (далее – Заказчик) заключить договор по разработке тестовых вопросов для пробного тестирования (далее – Оферта) на веб-сайте <a href="%s">bbtest.kz</a> (далее – Сайт) с любыми совершеннолетними лицами, которые подтвердили свое полное и безоговорочное согласие с условиями настоящей Оферты, зарегистрировались на Сайте путем заполнения личных данных (далее – Разработчик).</p>
<p class="text-justify text-normal mb-10">В соответствии со статьями 395 – 399 Гражданского кодекса Республики Казахстан, принятие и подтверждение Разработчиком своего полного и безоговорочного согласия с условиями настоящей Оферты равносильно заключению договора публичной оферты (далее – Договор) на условиях, изложенных в настоящем документе.</p>
<p class="text-justify text-normal mb-10">В СВЯЗИ С ВЫШЕИЗЛОЖЕННЫМ, ВНИМАТЕЛЬНО ОЗНАКОМЬТЕСЬ С ТЕКСТОМ НАСТОЯЩЕГО ДОКУМЕНТА. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С КАКИМ-ЛИБО ПУНКТОМ ОФЕРТЫ, ЗАКАЗЧИК ПРЕДЛАГАЕТ ВАМ ОТКАЗАТЬСЯ ОТ РЕГИСТРАЦИИ НА САЙТЕ.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">1.2.</span>Оферта считается принятой Разработчиком полностью и безоговорочно и договор заключенным между Заказчиком и Разработчиком, совместно именуемыми Сторонами с момента выполнения Разработчиком совокупности следующих действий:<br>1) Регистрация на Сайте путем заполнения личных данных;<br>2) Загрузка тестовых вопросов на Сайт для рассмотрения Заказчиком.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">2.</span>ПРЕДМЕТ ДОГОВОРА</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.1.</span>По настоящему Договору Разработчик обязуется оказать услуги по разработке тестовых вопросов для пробного тестирования на Сайте (далее – Услуги), а Заказчик оплатить Услуги в соответствии с условиями настоящего Договора.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">2.2.</span>Услуги считаются оказанными после проведения Заказчиком проверки содержания тестовых вопросов на соответствие тестовой спецификации по предмету/разделу пробного тестирования, находящейся на Сайте, (далее – Экспертиза).</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">2.3.</span>Сроки проведения Проверки устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">3.</span>СТОИМОСТЬ ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.1.</span>Согласно условиям настоящего Договора Заказчик обязуется оплатить 50%% от общей вырученной суммы в течение периода сотрудничества.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.2.</span>Стоимость Договора не включает в себя налог на добавленную стоимость.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.3.</span>Оплата за осуществление Услуг производится путем перечисления денежных средств на банковский счет Разработчика, указанного при регистрации на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.4.</span>Оплата за осуществление Услуг производится только в безналичной форме. Любые банковские комиссии при получении оплаты от Заказчика оплачиваются Разработчиком за свой счет.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">3.5.</span>Сроки оплаты за осуществление Услуг устанавливает Заказчик.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">3.6.</span>Период сотрудничества с Разработчиком устанавливает Заказчик.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">4.</span>ОБЯЗАННОСТИ СТОРОН</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.</span>Заказчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.1.</span>Оплатить Услуги в соответствии с условиями настоящего Договора;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.2.</span>Не разглашать и не передавать третьим лицам сведения о Разработчике;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.1.3.</span>Оповестить Разработчика о любых изменениях в условиях настоящего Договора путем опубликования на Сайте.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.</span>Разработчик обязуется:</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.1.</span>Предоставить достоверную информацию о себе в личном кабинете Сайта;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.2.</span>Предоставить Заказчику копии документов, подтверждающих специальные знания и профессиональные навыки Разработчика, для предоставления Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.3.</span>Соблюдать Законы РК при предоставлении Услуг;</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">4.2.4.</span>Не нарушать авторское право третьих лиц при предоставлении Услуг в том числе не копировать тестовые вопросы и/или тексты с официальных источников организаций образования;</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">4.2.5.</span>Качественно предоставить Услуги Заказчику согласно Тестовой спецификации.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">5.</span>ОТВЕТСТВЕННОСТЬ СТОРОН И ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.1.</span>Заказчик несет полную ответственность за достоверность данных указанных в заявке на участие в пробном тестировании.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">5.2.</span>За исключением обстоятельств непреодолимой силы (форс-мажор) за неисполнение или ненадлежащее исполнение обязательств по настоящему Договору Стороны несут ответственность в соответствии с действующим законодательством Республики Казахстан.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">5.3.</span>Споры и разногласия, которые могут возникать при исполнении настоящего Договора, будут по возможности разрешаться путем переговоров между Сторонами.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">6.</span>ФОРС-МАЖОР</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">6.1.</span>Стороны не несут ответственность за неисполнение условий Договора, если оно явилось результатом форс-мажорных обстоятельств.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">6.2.</span>&laquo;Форс-мажор&raquo; означает событие, неподвластное контролю Сторон, и имеющее непредвиденный характер. Такие события могут включать: военные действия, природные или стихийные бедствия и другие.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">7.</span>ПРОЧИЕ УСЛОВИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">7.1.</span>Разработчик не вправе привлекать для выполнения своих обязательств по Договору третьих лиц без согласования с Заказчиком.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">7.2.</span>В случае возникновения вопросов Разработчик вправе обратиться к Заказчику через Сайт.</p>

<h6 class="mt-15 mb-10"><span class="text-left mr-5">8.</span>ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h6>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.1.</span>Настоящий Договор вступает в силу с момента регистрации Разработчика на Сайте и действует до полного исполнения Сторонами своих обязательств.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.2.</span>Заказчик оставляет за собой право вносить изменения в условия настоящего Договора или отозвать Оферту в любой момент по своему усмотрению. Датой вступления в силу изменений настоящей Оферты является дата опубликования на Сайте Оферты или информации об отзыве Оферты.</p>
<p class="text-justify text-normal mb-0"><span class="text-left mr-5">8.3.</span>Принимая условия настоящей Оферты путем ее акцепта, Заказчик подтверждает, что заключает Договор добровольно и соглашается со всеми условиями, изложенными в Оферте.</p>
<p class="text-justify text-normal mb-10"><span class="text-left mr-5">8.4.</span>Настоящая Оферта составлена в единственном экземпляре и опубликована на Сайте.</p>
        """ % settings.BB_BASE_URL,
    },
}
